; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	thermograph3 - mode
	infrared1 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	Star1 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation4 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument2 thermograph3)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph3)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph0)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
)
(:goal (and
	(pointing satellite0 Star1)
	(pointing satellite2 Phenomenon9)
	(pointing satellite3 GroundStation0)
	(have_image Planet5 spectrograph2)
	(have_image Planet6 spectrograph2)
	(have_image Planet7 infrared1)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 thermograph3)
	(have_image Planet10 thermograph3)
	(have_image Phenomenon11 spectrograph0)
	(have_image Phenomenon12 thermograph3)
))

)

; plan
1. (turn_to satellite3 groundstation4 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 groundstation4)
   goals met: 0 of 11
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 11
3. (calibrate satellite3 instrument5 groundstation4)
   added: (calibrated instrument5)
   goals met: 0 of 11
4. (turn_to satellite3 star8 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 star8)
   goals met: 0 of 11
5. (take_image satellite3 star8 instrument5 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 1 of 11
6. (turn_to satellite3 phenomenon11 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 phenomenon11)
   goals met: 1 of 11
7. (take_image satellite3 phenomenon11 instrument5 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 2 of 11
8. (turn_to satellite3 star2 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 star2)
   goals met: 2 of 11
9. (switch_off instrument5 satellite3)
   deleted: (power_on instrument5)
   added: (power_avail satellite3)
   goals met: 2 of 11
10. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 2 of 11
11. (calibrate satellite3 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 2 of 11
12. (turn_to satellite0 star1 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star1)
   goals met: 3 of 11
13. (turn_to satellite2 phenomenon9 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon9)
   goals met: 4 of 11
14. (turn_to satellite3 phenomenon12 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon12)
   goals met: 4 of 11
15. (take_image satellite3 phenomenon12 instrument4 thermograph3)
   added: (have_image phenomenon12 thermograph3)
   goals met: 5 of 11
16. (turn_to satellite3 phenomenon9 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon9)
   goals met: 5 of 11
17. (take_image satellite3 phenomenon9 instrument4 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 6 of 11
18. (turn_to satellite3 planet10 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 planet10)
   goals met: 6 of 11
19. (take_image satellite3 planet10 instrument4 thermograph3)
   added: (have_image planet10 thermograph3)
   goals met: 7 of 11
20. (turn_to satellite3 planet5 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 planet5)
   goals met: 7 of 11
21. (take_image satellite3 planet5 instrument4 spectrograph2)
   added: (have_image planet5 spectrograph2)
   goals met: 8 of 11
22. (turn_to satellite3 planet6 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 planet6)
   goals met: 8 of 11
23. (take_image satellite3 planet6 instrument4 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 9 of 11
24. (turn_to satellite3 planet7 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 planet7)
   goals met: 9 of 11
25. (take_image satellite3 planet7 instrument4 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 10 of 11
26. (turn_to satellite3 groundstation0 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 groundstation0)
   goals met: 11 of 11
